In [3]:
import pandas as pd

series  = pd.Series([10,20,30])
print(series)

0    10
1    20
2    30
dtype: int64

In [30]:
import pandas as pd 
data = {'Name': ['Alice' , 'bob', 'Said','MM'] ,
        'Age' : [25,60,10,27],
        'City': ['Cairo', 'Seuz' , 'Lisbon','Ismailia']
        }

df = pd.DataFrame(data)
print(df)

    Name  Age      City
0  Alice   25     Cairo
1    bob   60      Seuz
2   Said   10    Lisbon
3     MM   27  Ismailia

In [6]:
df.head()

    Name  Age    City
0  Alice   25   Cairo
1    bob   60    Seuz
2   Said   10  Lisbon

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [11]:
df.describe()

             Age
count   3.000000
mean   31.666667
std    25.658007
min    10.000000
25%    17.500000
50%    25.000000
75%    42.500000
max    60.000000

In [13]:
print(df['Name'])
print("-------------------------------------")
print(df['Age'])

0    Alice
1      bob
2     Said
Name: Name, dtype: object
-------------------------------------
0    25
1    60
2    10
Name: Age, dtype: int64

In [14]:
filterd_df = df[df['Age']>10]
print(filterd_df)

    Name  Age   City
0  Alice   25  Cairo
1    bob   60   Seuz

In [26]:
selected_data = df.loc[1:2,['Name','City']]
print(selected_data)

   Name    City
1   bob    Seuz
2  Said  Lisbon

In [28]:
df['Salary'] = [700,1000,250]
df

    Name  Age    City  Salary
0  Alice   25   Cairo     700
1    bob   60    Seuz    1000
2   Said   10  Lisbon     250

In [29]:
df['Age'] = df['Age'] + 1
df

    Name  Age    City  Salary
0  Alice   26   Cairo     700
1    bob   61    Seuz    1000
2   Said   11  Lisbon     250

In [38]:
data = {'Name': ['Alice' , 'bob', 'Said','MM'] ,
        'Age' : [25,60,10,27],
        'City': ['Cairo', 'Seuz' , 'Lisbon','Ismailia']
        }

df = pd.DataFrame(data)

df['Salary'] = [700,1000,250,2500]

#df = df.drop('City' , axis=1)
df

    Name  Age      City  Salary
0  Alice   25     Cairo     700
1    bob   60      Seuz    1000
2   Said   10    Lisbon     250
3     MM   27  Ismailia    2500

In [39]:
data = {'Name': ['Alice' , 'bob', 'Said','MM'] ,
        'Age' : [25,60,10,27],
        'City': ['Cairo', 'Seuz' , 'Lisbon','Ismailia']
        }

df = pd.DataFrame(data)

df['Salary'] = [700,1000,250,2500]

df = df.drop('City' , axis=1)
df

    Name  Age  Salary
0  Alice   25     700
1    bob   60    1000
2   Said   10     250
3     MM   27    2500

In [40]:
data = {'Name': ['Alice' , 'bob', 'Said','MM'] ,
        'Age' : [25,60,10,27],
        'City': ['Cairo', 'Seuz' , 'Lisbon','Ismailia']
        }

df = pd.DataFrame(data)

df['Salary'] = [700,1000,250,2500]

df = df.drop('City' , axis=1)
df = df.drop(2 , axis=0)
df

    Name  Age  Salary
0  Alice   25     700
1    bob   60    1000
3     MM   27    2500

In [46]:
def dataframe():    

    data = {'Name': ['Alice' , 'bob', 'Said','MM'] ,
        'Age' : [25,60,10,27],
        'City': ['Cairo', 'Seuz' , 'Lisbon','Ismailia']
        }
    df = pd.DataFrame(data)
    df['Salary'] = [700,1000,250,2500]

    return df

def dataframe_null():    

    data = {'Name': [None , 'bob', 'Said','MM'] ,
        'Age' : [25,None,10,None],
        'City': ['Cairo',None , 'Lisbon','Ismailia']
        }
   
    dfnull['Salary'] = [700,1000,250,None]
    dfnull = pd.DataFrame(data)
    return dfnull

df      = dataframe()
dfnull  = dataframe_null()

In [44]:
df

    Name  Age      City  Salary
0  Alice   25     Cairo     700
1    bob   60      Seuz    1000
2   Said   10    Lisbon     250
3     MM   27  Ismailia    2500

In [47]:
dfnull

   Name   Age      City  Salary
0  None  25.0     Cairo     700
1   bob   NaN      None    1000
2  Said  10.0    Lisbon     250
3    MM   NaN  Ismailia    2500

In [50]:
dfnull.isnull()

    Name    Age   City  Salary
0   True  False  False   False
1  False   True   True   False
2  False  False  False   False
3  False   True  False   False

In [51]:
dfnull.isnull().sum()

Name      1
Age       2
City      1
Salary    0
dtype: int64

In [52]:
dfnull.isnull().sum().sum()

4

In [54]:
df[['Age','Salary']].describe()

             Age  Salary
count   4.000000     4.0
mean   30.500000  1112.5
std    21.079216   975.0
min    10.000000   250.0
25%    21.250000   587.5
50%    26.000000   850.0
75%    35.250000  1375.0
max    60.000000  2500.0

In [59]:
dfnull['Age'] = dfnull['Age'].fillna(dfnull['Age'].mean())
dfnull['Salary'] = dfnull['Salary'].fillna(dfnull['Salary'].mean())
dfnull

   Name   Age      City  Salary
0  None  25.0     Cairo     700
1   bob  17.5      None    1000
2  Said  10.0    Lisbon     250
3    MM  17.5  Ismailia    2500

In [63]:
dataframe_null()

   Name   Age      City  Salary
0  None  25.0     Cairo     700
1   bob   NaN      None    1000
2  Said  10.0    Lisbon     250
3    MM   NaN  Ismailia    2500

In [64]:
cleaned_df = dfnull.dropna()
cleaned_df

   Name   Age      City  Salary
2  Said  10.0    Lisbon     250
3    MM  17.5  Ismailia    2500

In [72]:
# inc salarie by 25%
def inc_salary():
    df['New Salary'] = df['Salary'] + (df['Salary']*0.25)


print("=====================================")
print(df)
print("=====================================")

df['Amount of inc'] = df['Salary'] * 0.25
inc_salary()
df

=====================================
    Name  Age      City  Salary  Amount of inc  New Salary
0  Alice   25     Cairo     700          175.0       875.0
1    bob   60      Seuz    1000          250.0      1250.0
2   Said   10    Lisbon     250           62.5       312.5
3     MM   27  Ismailia    2500          625.0      3125.0
=====================================

    Name  Age      City  Salary  Amount of inc  New Salary
0  Alice   25     Cairo     700          175.0       875.0
1    bob   60      Seuz    1000          250.0      1250.0
2   Said   10    Lisbon     250           62.5       312.5
3     MM   27  Ismailia    2500          625.0      3125.0

In [74]:
def dec_salary(x):
    return x/1.25

df['New dec Salary'] = df['New Salary'].apply(dec_salary)
df

    Name  Age      City  Salary  Amount of inc  New Salary  New dec Salary
0  Alice   25     Cairo     700          175.0       875.0           700.0
1    bob   60      Seuz    1000          250.0      1250.0          1000.0
2   Said   10    Lisbon     250           62.5       312.5           250.0
3     MM   27  Ismailia    2500          625.0      3125.0          2500.0

In [1]:
import pandas as pd

# Data from the table
data = {
    'Name': ['Jake', 'Joe', 'Susan', 'Sol', 'Chris'],
    'Previous_Part': [32.0, 32.0, 30.0, 31.0, 30.0],
    'Participation1': [1, 1, 1, 1, 1],
    'Mini_Exam1': [19.5, 20.0, 19.0, 22.0, 19.0],
    'Mini_Exam2': [20, 16, 19, 13, 17],
    'Participation2': [1, 1, 1, 1, 1],
    'Mini_Exam3': [10.0, 14.0, 10.5, 13.0, 12.5],
    'Final': [33.0, 32.0, 33.0, 34.0, 33.5],
    'Grade': ['A', 'A', 'A-', 'A', 'A'],
    'ID': [90743, 7284, 7625, 1237, 62],
}

# Create a DataFrame
df = pd.DataFrame(data)

# Save as CSV
df.to_csv('student_data.csv', index=False)

print("CSV file 'student_data.csv' created.")

CSV file 'student_data.csv' has been created.

In [5]:
df_grades = pd.read_csv("student_data.csv")
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62

In [9]:
df_grades.shape

(5, 10)

In [10]:
df_grades.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
ID                  int64
dtype: object

In [11]:
df_grades.columns

Index(['Name', 'Previous_Part', 'Participation1', 'Mini_Exam1', 'Mini_Exam2',
       'Participation2', 'Mini_Exam3', 'Final', 'Grade', 'ID'],
      dtype='object')

In [12]:
df_grades.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df_grades[["Name","Grade"]]

    Name Grade
0   Jake     A
1    Joe     A
2  Susan    A-
3    Sol     A
4  Chris     A

In [14]:
df_grades.Name

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
Name: Name, dtype: object

In [18]:
names = df_grades.Name
names[1:2]

1    Joe
Name: Name, dtype: object

In [19]:
first_name = df_grades.loc[0,'Name']
first_name

'Jake'

In [26]:
counts = df_grades['Grade'].value_counts()
counts

Grade
A     4
A-    1
Name: count, dtype: int64

In [28]:
df_grades["New col"]=1
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,New col
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,1
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,1
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,1
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,1
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,1

In [31]:
df_grades['final percentage'] = df_grades['Final'] /36 * 100
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,New col,final percentage
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,1,91.666667
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,1,88.888889
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,1,91.666667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,1,94.444444
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,1,93.055556

In [32]:
del df_grades['New col']
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,final percentage
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,91.666667
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,88.888889
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,91.666667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,94.444444
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,93.055556

In [33]:
import pandas as pd

# Data from the table
data = {
    'Name': ['Jake', 'Joe', 'Sol', 'Chris'],
    'Previous_Part': [32.0, None, 31.0, 30.0],
    'Participation1': [1, 1, 1, -1],
    'Mini_Exam1': [19.5, 20.0, 22.0, 19.0],
    'Mini_Exam2': [20, 16, 13, 'not available'],
    'Participation2': [1, 1, 1, 1],
    'Mini_Exam3': [10.0, 14.0, 13.0, 12.5],
    'Final': [33.0, 32.0, 34.0, 33.5],
    'Grade': ['A', 'A', 'A', 'A'],
    'Temp': [-1, 23, 34, 72],
}

# Create a DataFrame
df = pd.DataFrame(data)

# Save as CSV
df.to_csv('Missing_student_data.csv', index=False)

print("CSV file 'Missing_student_data.csv' has been created.")

CSV file 'Missing_student_data.csv' has been created.

In [37]:
df_missing = pd.read_csv('Missing_student_data.csv', na_values={"Mini_Exam2" : "not available" , "Participation1" : -1})
df_missing.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,-1
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72

In [38]:
df_missing.isnull().sum()

Name              0
Previous_Part     1
Participation1    1
Mini_Exam1        0
Mini_Exam2        1
Participation2    0
Mini_Exam3        0
Final             0
Grade             0
Temp              0
dtype: int64